package Osnovi_java;

public class Task13 {

    // Напечатать числа следующим образом:
    // 10 10.4
    // 11 11.4
    // ......
    // 25 25.4
    public static void main(String[] args) {
        for (int i = 10; i <=25; i++) {
            //  System.out.println(i + " ");              // Чтобы вывести только целые числа
            System.out.println(i + " " + (i + 0.4));   // Чтобы добавить 0.4 , либо как число прибавить
            // либо склеить с  0.4 как со строковым значением System.out.println(i + " " + i + "0.4"));
            // Строковое значение обязательно в двойных ковычках
        }
    }
}
